# ══════════════════════════════════════════════════════════
# config.py — إعدادات البوت
# ══════════════════════════════════════════════════════════

# ضع هنا توكن البوت من @BotFather
import os

TOKEN = os.getenv("TOKEN")

# ضع هنا الـ ID بتاعك كأدمن (ممكن تحط أكتر من واحد)
# عشان تعرف الـ ID بتاعك ابعت رسالة لـ @userinfobot
ADMIN_IDS = [
    6098463726,   # ← غير ده بالـ ID بتاعك
    # 987654321, # ← ممكن تضيف أدمن تاني هنا
]

# سعر الدولار بالجنيه المصري لعرض السعر المحلي للمستخدم
EGP_EXCHANGE_RATE = 55
